Картриджи/src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.ОстаткиКартриджей</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретСоздания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Картриджи</name>
    <attributes>
      <name>Картриджи</name>
      <type>
        <types>CatalogRef.МоделиКартриджей</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картриджи/src/Documents/Списание/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьПроизводителя(Картридж)
	
	Возврат Картридж.Модель.Производитель;	
	
КонецФункции // ПолучитьПроизводителя()

&НаКлиенте
Процедура КартриджиКартриджиПриИзменении(Элемент)
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Производитель = ПолучитьПроизводителя(Стр.Картриджи);
	//Стр.Количество = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	П = Новый Структура("Праметр",Объект);
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаПодбора", П, ЭтаФорма);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	 ПроверкаНаОдинаковыеСтроки();
	
КонецПроцедуры
 
 &НаСервере
Процедура ПроверкаНаОдинаковыеСтроки()
	
	ТЗ_Картриджи = Объект.Картриджи.Выгрузить();
	
	ТЗ_Картриджи.Свернуть("Картриджи, Производитель, Комментарий", "Количество");
	
	Объект.Картриджи.Очистить();
	Объект.Картриджи.Загрузить(ТЗ_Картриджи); 	
		
КонецПроцедуры // ПРоВеркаНаОдинаковыесТРОКИ()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Дата = НачалоДня(ТекущаяДата()) ТОгда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	
КонецПроцедуры
